let reverso = 10;
let ímpar = 1;
let pares = 0;

//  ----------------------------------------------------Estrutura 1-------------------------------------------------------

// for (let verso = 1; verso <= 10; verso ++ ) {
//     console.log (verso)
// }

// -------------------------------------------------------Estrutura 2--------------------------------------------------------

// while (reverso >= 1) {
//     console.log (reverso);
//     reverso -=1;
// }

// --------------------------------------------------------Estrutura 3----------------------------------------------------------

// for (let ímpares = 1; ímpares <= 100; ímpares +=2 ) {
//     console.log (ímpares)
// }

// while (ímpar <= 100) {
//     console.log (ímpar);
//     ímpar +=2;
// }

// -------------------------------------------------------Estrutura 4---------------------------------------------------------------

// for (let pares = 0; pares <= 100; pares +=2 ) {
//     console.log (pares)
// }

// while (pares <= 100) {
//     console.log (pares);
//     pares +=2;
// }

